<script setup lang="ts">
useHead({
    title: 'О блоге',
})
</script>
<template>
    <div class="flex flex-col h-full min-h-dvh min-w-dvw w-full">
        <AppHeader :items="[{ link: '/', title: 'На главную' }]" />
        <div class="flex justify-center h-full w-full">
            <div class="flex flex-col gap-8 p-4 h-full max-w-lg">
                <h2 class="font-bold text-2xl">О блоге</h2>
                <p>Добро пожаловать в мой технический блог! Здесь я документирую свой путь изучения современных
                    веб-технологий: JavaScript, TypeScript, Vue 3 и Nuxt.
                </p>
                <p>Этот проект — не просто блог, а интерактивный дневник обучения, где каждый день представляет собой
                    новый
                    урок или задачу. Я прохожу через 30-дневный челлендж, в котором последовательно осваиваю:</p>
                <ul>
                    <li>📁 Структуру проектов на Nuxt </li>
                    <li>🔄 Роутинг и навигацию между страницами</li>
                    <li>🧩 Компоненты и работу с пропсами</li>
                    <li>⚙️ State management и композицию</li>
                    <li>🎨 Стилизацию и UI/UX</li>
                    <li>🚀 Деплой и продакшн-подготовку</li>
                </ul>

                <p>Каждая папка dayX — это завершённый урок с конкретными задачами и критериями успеха. Я делюсь своими
                    находками, ошибками и решениями, чтобы этот опыт мог помочь другим, кто идёт похожим путём.
                </p>
                <p> Цель: стать лучше в разработке на Vue/Nuxt и создать работающий проект в процессе обучения.</p>
            </div>
        </div>
    </div>

</template>